import math

mass = [
    ["Количество рейсов", 50],
    ["Количество рейсов", 45],
    ["Количество рейсов", 51],
    ["Количество рейсов", 55],
    ["Количество рейсов", 62],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 57],
    ["Количество рейсов", 56],
    ["Количество рейсов", 50],
    ["Количество рейсов", 46],
    ["Количество рейсов", 51],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 51],
    ["Количество рейсов", 59],
    ["Количество рейсов", 52],
    ["Количество рейсов", 43],
    ["Количество рейсов", 57],
    ["Количество рейсов", 55],
    ["Количество рейсов", 63],
    ["Количество рейсов", 50],
    ["Количество рейсов", 58],
    ["Количество рейсов", 52],
    ["Количество рейсов", 58],
    ["Количество рейсов", 56],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 57],
    ["Количество рейсов", 56],
    ["Количество рейсов", 50],
    ["Количество рейсов", 46],
    ["Количество рейсов", 51],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 59],
    ["Количество рейсов", 52],
    ["Количество рейсов", 43],
    ["Количество рейсов", 57],
    ["Количество рейсов", 55],
    ["Количество рейсов", 63],
    ["Количество рейсов", 50],
    ["Количество рейсов", 58],
    ["Количество рейсов", 52],
    ["Количество рейсов", 50],
    ["Количество рейсов", 45],
    ["Количество рейсов", 51],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 52],
    ["Количество рейсов", 57],
    ["Количество рейсов", 50],
    ["Количество рейсов", 45],
    ["Количество рейсов", 50],
    ["Количество рейсов", 45],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 51],
    ["Количество рейсов", 59],
    ["Количество рейсов", 52],
    ["Количество рейсов", 43],
    ["Количество рейсов", 50],
    ["Количество рейсов", 46],
    ["Количество рейсов", 51],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 50],
    ["Количество рейсов", 46],
    ["Количество рейсов", 63],
    ["Количество рейсов", 52],
    ["Количество рейсов", 43],
    ["Количество рейсов", 56],
    ["Количество рейсов", 50],
    ["Количество рейсов", 46],
    ["Количество рейсов", 51],
    ["Количество рейсов", 53],
    ["Количество рейсов", 61],
    ["Количество рейсов", 53],
    ["Количество рейсов", 57],
    ["Количество рейсов", 59],
    ["Количество рейсов", 63],
    ["Количество рейсов", 50],
    ["Количество рейсов", 58],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 52],
    ["Количество рейсов", 57],
    ["Количество рейсов", 48]

]
minimum = 100
maximum = 0
for i in mass:
    if i[1] < minimum:
        minimum = i[1]
    if i[1] > maximum:
        maximum = i[1]
print(minimum, 'min')
print(maximum, 'max')

print(f"{maximum - minimum}")
count = [0] * 10
for i in range(10):
    count[i] = (minimum + i * 2)
print(count)

new_count = [0] * 10
for i in range(len(count) - 1):
    for j in mass:
        if count[i] < j[1] <= count[i + 1]:
            new_count[i] += 1
        if count[len(count) - 1] < j[1] <= maximum:
            new_count[-1] += 1
print(new_count)

awg = [0] * 10
for i in range(len(count) - 1):
    for j in mass:
        if count[i] < j[1] <= count[i + 1]:
            awg[i] += j[1]
        if count[len(count) - 1] < j[1] <= maximum:
            awg[-1] += j[1]
print(awg)

new_awg = [0] * 10
for i in range(len(count)):
    new_awg[i] = new_count[i] / 100
print(new_awg)

gg = [0] * 10
for i in range(len(count)):
    gg[i] = awg[i] / new_count[i]
print(gg)

mass_x = [106215, 115026, 125276, 135447, 144948, 156003, 166492,
          177508, 184333, 195108]
mass_p = [0.13, 0.11, 0.12, 0.06, 0.60, 0.10, 0.14, 0.60, 0.15, 0.70]

math_stop = 0
for i in range(10):
    math_stop += gg[i] * new_awg[i]
    # math_stop += mass_p[i] * mass_x[i]
print(math_stop)

disp = 0
for i in range(10):
    disp += (gg[i]) ** 2 * new_awg[i]
    # disp += mass_p[i] * (mass_x[i]) ** 2
disp = disp - (math_stop ** 2)
print(disp)
print(math.sqrt(abs(disp)))

entr = 0
for i in range(len(count)):
    entr += new_awg[i] * math.log2(new_awg[i])
print(f'entropy = {-entr}')



abcde = ['a' ,'fx', 'fd', 'fx', 'aa', 'ab']
abcde = sorted(abcde)
for i in abcde:
    print(i)